GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0063h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_CLKRMD_POSN                         equ 0001h
PMD0_CLKRMD_POSITION                     equ 0001h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0002h
PMD0_SCANMD_POSN                         equ 0003h
PMD0_SCANMD_POSITION                     equ 0003h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0008h
PMD0_CRCMD_POSN                          equ 0004h
PMD0_CRCMD_POSITION                      equ 0004h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0010h
PMD0_LVDMD_POSN                          equ 0005h
PMD0_LVDMD_POSITION                      equ 0005h
PMD0_LVDMD_SIZE                          equ 0001h
PMD0_LVDMD_LENGTH                        equ 0001h
PMD0_LVDMD_MASK                          equ 0020h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0064h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_SMT1MD_POSN                         equ 0005h
PMD1_SMT1MD_POSITION                     equ 0005h
PMD1_SMT1MD_SIZE                         equ 0001h
PMD1_SMT1MD_LENGTH                       equ 0001h
PMD1_SMT1MD_MASK                         equ 0020h
PMD1_ZCDMD_POSN                          equ 0006h
PMD1_ZCDMD_POSITION                      equ 0006h
PMD1_ZCDMD_SIZE                          equ 0001h
PMD1_ZCDMD_LENGTH                        equ 0001h
PMD1_ZCDMD_MASK                          equ 0040h
PMD1_CM1MD_POSN                          equ 0007h
PMD1_CM1MD_POSITION                      equ 0007h
PMD1_CM1MD_SIZE                          equ 0001h
PMD1_CM1MD_LENGTH                        equ 0001h
PMD1_CM1MD_MASK                          equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0065h
// bitfield definitions
PMD2_CM2MD_POSN                          equ 0000h
PMD2_CM2MD_POSITION                      equ 0000h
PMD2_CM2MD_SIZE                          equ 0001h
PMD2_CM2MD_LENGTH                        equ 0001h
PMD2_CM2MD_MASK                          equ 0001h
PMD2_ADCMD_POSN                          equ 0001h
PMD2_ADCMD_POSITION                      equ 0001h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0002h
PMD2_DAC1MD_POSN                         equ 0002h
PMD2_DAC1MD_POSITION                     equ 0002h
PMD2_DAC1MD_SIZE                         equ 0001h
PMD2_DAC1MD_LENGTH                       equ 0001h
PMD2_DAC1MD_MASK                         equ 0004h
PMD2_ACTMD_POSN                          equ 0003h
PMD2_ACTMD_POSITION                      equ 0003h
PMD2_ACTMD_SIZE                          equ 0001h
PMD2_ACTMD_LENGTH                        equ 0001h
PMD2_ACTMD_MASK                          equ 0008h
PMD2_NCO1MD_POSN                         equ 0004h
PMD2_NCO1MD_POSITION                     equ 0004h
PMD2_NCO1MD_SIZE                         equ 0001h
PMD2_NCO1MD_LENGTH                       equ 0001h
PMD2_NCO1MD_MASK                         equ 0010h
PMD2_DSM1MD_POSN                         equ 0005h
PMD2_DSM1MD_POSITION                     equ 0005h
PMD2_DSM1MD_SIZE                         equ 0001h
PMD2_DSM1MD_LENGTH                       equ 0001h
PMD2_DSM1MD_MASK                         equ 0020h
PMD2_CWG1MD_POSN                         equ 0006h
PMD2_CWG1MD_POSITION                     equ 0006h
PMD2_CWG1MD_SIZE                         equ 0001h
PMD2_CWG1MD_LENGTH                       equ 0001h
PMD2_CWG1MD_MASK                         equ 0040h
PMD2_CCP1MD_POSN                         equ 0007h
PMD2_CCP1MD_POSITION                     equ 0007h
PMD2_CCP1MD_SIZE                         equ 0001h
PMD2_CCP1MD_LENGTH                       equ 0001h
PMD2_CCP1MD_MASK                         equ 0080h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0066h
// bitfield definitions
PMD3_PWM1MD_POSN                         equ 0000h
PMD3_PWM1MD_POSITION                     equ 0000h
PMD3_PWM1MD_SIZE                         equ 0001h
PMD3_PWM1MD_LENGTH                       equ 0001h
PMD3_PWM1MD_MASK                         equ 0001h
PMD3_PWM2MD_POSN                         equ 0001h
PMD3_PWM2MD_POSITION                     equ 0001h
PMD3_PWM2MD_SIZE                         equ 0001h
PMD3_PWM2MD_LENGTH                       equ 0001h
PMD3_PWM2MD_MASK                         equ 0002h
PMD3_PWM3MD_POSN                         equ 0002h
PMD3_PWM3MD_POSITION                     equ 0002h
PMD3_PWM3MD_SIZE                         equ 0001h
PMD3_PWM3MD_LENGTH                       equ 0001h
PMD3_PWM3MD_MASK                         equ 0004h
PMD3_I2C1MD_POSN                         equ 0003h
PMD3_I2C1MD_POSITION                     equ 0003h
PMD3_I2C1MD_SIZE                         equ 0001h
PMD3_I2C1MD_LENGTH                       equ 0001h
PMD3_I2C1MD_MASK                         equ 0008h
PMD3_SPI1MD_POSN                         equ 0004h
PMD3_SPI1MD_POSITION                     equ 0004h
PMD3_SPI1MD_SIZE                         equ 0001h
PMD3_SPI1MD_LENGTH                       equ 0001h
PMD3_SPI1MD_MASK                         equ 0010h
PMD3_SPI2MD_POSN                         equ 0005h
PMD3_SPI2MD_POSITION                     equ 0005h
PMD3_SPI2MD_SIZE                         equ 0001h
PMD3_SPI2MD_LENGTH                       equ 0001h
PMD3_SPI2MD_MASK                         equ 0020h
PMD3_U1MD_POSN                           equ 0006h
PMD3_U1MD_POSITION                       equ 0006h
PMD3_U1MD_SIZE                           equ 0001h
PMD3_U1MD_LENGTH                         equ 0001h
PMD3_U1MD_MASK                           equ 0040h
PMD3_U2MD_POSN                           equ 0007h
PMD3_U2MD_POSITION                       equ 0007h
PMD3_U2MD_SIZE                           equ 0001h
PMD3_U2MD_LENGTH                         equ 0001h
PMD3_U2MD_MASK                           equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0067h
// bitfield definitions
PMD4_U3MD_POSN                           equ 0000h
PMD4_U3MD_POSITION                       equ 0000h
PMD4_U3MD_SIZE                           equ 0001h
PMD4_U3MD_LENGTH                         equ 0001h
PMD4_U3MD_MASK                           equ 0001h
PMD4_CLC1MD_POSN                         equ 0001h
PMD4_CLC1MD_POSITION                     equ 0001h
PMD4_CLC1MD_SIZE                         equ 0001h
PMD4_CLC1MD_LENGTH                       equ 0001h
PMD4_CLC1MD_MASK                         equ 0002h
PMD4_CLC2MD_POSN                         equ 0002h
PMD4_CLC2MD_POSITION                     equ 0002h
PMD4_CLC2MD_SIZE                         equ 0001h
PMD4_CLC2MD_LENGTH                       equ 0001h
PMD4_CLC2MD_MASK                         equ 0004h
PMD4_CLC3MD_POSN                         equ 0003h
PMD4_CLC3MD_POSITION                     equ 0003h
PMD4_CLC3MD_SIZE                         equ 0001h
PMD4_CLC3MD_LENGTH                       equ 0001h
PMD4_CLC3MD_MASK                         equ 0008h
PMD4_CLC4MD_POSN                         equ 0004h
PMD4_CLC4MD_POSITION                     equ 0004h
PMD4_CLC4MD_SIZE                         equ 0001h
PMD4_CLC4MD_LENGTH                       equ 0001h
PMD4_CLC4MD_MASK                         equ 0010h
PMD4_DMA1MD_POSN                         equ 0005h
PMD4_DMA1MD_POSITION                     equ 0005h
PMD4_DMA1MD_SIZE                         equ 0001h
PMD4_DMA1MD_LENGTH                       equ 0001h
PMD4_DMA1MD_MASK                         equ 0020h
PMD4_DMA2MD_POSN                         equ 0006h
PMD4_DMA2MD_POSITION                     equ 0006h
PMD4_DMA2MD_SIZE                         equ 0001h
PMD4_DMA2MD_LENGTH                       equ 0001h
PMD4_DMA2MD_MASK                         equ 0040h
PMD4_DMA3MD_POSN                         equ 0007h
PMD4_DMA3MD_POSITION                     equ 0007h
PMD4_DMA3MD_SIZE                         equ 0001h
PMD4_DMA3MD_LENGTH                       equ 0001h
PMD4_DMA3MD_MASK                         equ 0080h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0068h
// bitfield definitions
PMD5_DMA4MD_POSN                         equ 0000h
PMD5_DMA4MD_POSITION                     equ 0000h
PMD5_DMA4MD_SIZE                         equ 0001h
PMD5_DMA4MD_LENGTH                       equ 0001h
PMD5_DMA4MD_MASK                         equ 0001h
PMD5_DAC2MD_POSN                         equ 0001h
PMD5_DAC2MD_POSITION                     equ 0001h
PMD5_DAC2MD_SIZE                         equ 0001h
PMD5_DAC2MD_LENGTH                       equ 0001h
PMD5_DAC2MD_MASK                         equ 0002h
PMD5_OPAMD_POSN                          equ 0002h
PMD5_OPAMD_POSITION                      equ 0002h
PMD5_OPAMD_SIZE                          equ 0001h
PMD5_OPAMD_LENGTH                        equ 0001h
PMD5_OPAMD_MASK                          equ 0004h

// Register: MD1CON0
#define MD1CON0 MD1CON0
MD1CON0                                  equ 006Ah
// bitfield definitions
MD1CON0_BIT_POSN                         equ 0000h
MD1CON0_BIT_POSITION                     equ 0000h
MD1CON0_BIT_SIZE                         equ 0001h
MD1CON0_BIT_LENGTH                       equ 0001h
MD1CON0_BIT_MASK                         equ 0001h
MD1CON0_OPOL_POSN                        equ 0004h
MD1CON0_OPOL_POSITION                    equ 0004h
MD1CON0_OPOL_SIZE                        equ 0001h
MD1CON0_OPOL_LENGTH                      equ 0001h
MD1CON0_OPOL_MASK                        equ 0010h
MD1CON0_OUT_POSN                         equ 0005h
MD1CON0_OUT_POSITION                     equ 0005h
MD1CON0_OUT_SIZE                         equ 0001h
MD1CON0_OUT_LENGTH                       equ 0001h
MD1CON0_OUT_MASK                         equ 0020h
MD1CON0_EN_POSN                          equ 0007h
MD1CON0_EN_POSITION                      equ 0007h
MD1CON0_EN_SIZE                          equ 0001h
MD1CON0_EN_LENGTH                        equ 0001h
MD1CON0_EN_MASK                          equ 0080h
MD1CON0_MD1BIT_POSN                      equ 0000h
MD1CON0_MD1BIT_POSITION                  equ 0000h
MD1CON0_MD1BIT_SIZE                      equ 0001h
MD1CON0_MD1BIT_LENGTH                    equ 0001h
MD1CON0_MD1BIT_MASK                      equ 0001h
MD1CON0_MD1OPOL_POSN                     equ 0004h
MD1CON0_MD1OPOL_POSITION                 equ 0004h
MD1CON0_MD1OPOL_SIZE                     equ 0001h
MD1CON0_MD1OPOL_LENGTH                   equ 0001h
MD1CON0_MD1OPOL_MASK                     equ 0010h
MD1CON0_MD1OUT_POSN                      equ 0005h
MD1CON0_MD1OUT_POSITION                  equ 0005h
MD1CON0_MD1OUT_SIZE                      equ 0001h
MD1CON0_MD1OUT_LENGTH                    equ 0001h
MD1CON0_MD1OUT_MASK                      equ 0020h
MD1CON0_MD1EN_POSN                       equ 0007h
MD1CON0_MD1EN_POSITION                   equ 0007h
MD1CON0_MD1EN_SIZE                       equ 0001h
MD1CON0_MD1EN_LENGTH                     equ 0001h
MD1CON0_MD1EN_MASK                       equ 0080h

