GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
// Register: OPA1CON2
#define OPA1CON2 OPA1CON2
OPA1CON2                                 equ 00A5h
// bitfield definitions
OPA1CON2_PCH_POSN                        equ 0000h
OPA1CON2_PCH_POSITION                    equ 0000h
OPA1CON2_PCH_SIZE                        equ 0003h
OPA1CON2_PCH_LENGTH                      equ 0003h
OPA1CON2_PCH_MASK                        equ 0007h
OPA1CON2_NCH_POSN                        equ 0004h
OPA1CON2_NCH_POSITION                    equ 0004h
OPA1CON2_NCH_SIZE                        equ 0003h
OPA1CON2_NCH_LENGTH                      equ 0003h
OPA1CON2_NCH_MASK                        equ 0070h
OPA1CON2_PCH0_POSN                       equ 0000h
OPA1CON2_PCH0_POSITION                   equ 0000h
OPA1CON2_PCH0_SIZE                       equ 0001h
OPA1CON2_PCH0_LENGTH                     equ 0001h
OPA1CON2_PCH0_MASK                       equ 0001h
OPA1CON2_PCH1_POSN                       equ 0001h
OPA1CON2_PCH1_POSITION                   equ 0001h
OPA1CON2_PCH1_SIZE                       equ 0001h
OPA1CON2_PCH1_LENGTH                     equ 0001h
OPA1CON2_PCH1_MASK                       equ 0002h
OPA1CON2_PCH2_POSN                       equ 0002h
OPA1CON2_PCH2_POSITION                   equ 0002h
OPA1CON2_PCH2_SIZE                       equ 0001h
OPA1CON2_PCH2_LENGTH                     equ 0001h
OPA1CON2_PCH2_MASK                       equ 0004h
OPA1CON2_NCH0_POSN                       equ 0004h
OPA1CON2_NCH0_POSITION                   equ 0004h
OPA1CON2_NCH0_SIZE                       equ 0001h
OPA1CON2_NCH0_LENGTH                     equ 0001h
OPA1CON2_NCH0_MASK                       equ 0010h
OPA1CON2_NCH1_POSN                       equ 0005h
OPA1CON2_NCH1_POSITION                   equ 0005h
OPA1CON2_NCH1_SIZE                       equ 0001h
OPA1CON2_NCH1_LENGTH                     equ 0001h
OPA1CON2_NCH1_MASK                       equ 0020h
OPA1CON2_NCH2_POSN                       equ 0006h
OPA1CON2_NCH2_POSITION                   equ 0006h
OPA1CON2_NCH2_SIZE                       equ 0001h
OPA1CON2_NCH2_LENGTH                     equ 0001h
OPA1CON2_NCH2_MASK                       equ 0040h
OPA1CON2_OPA1PCH_POSN                    equ 0000h
OPA1CON2_OPA1PCH_POSITION                equ 0000h
OPA1CON2_OPA1PCH_SIZE                    equ 0003h
OPA1CON2_OPA1PCH_LENGTH                  equ 0003h
OPA1CON2_OPA1PCH_MASK                    equ 0007h
OPA1CON2_OPA1NCH_POSN                    equ 0004h
OPA1CON2_OPA1NCH_POSITION                equ 0004h
OPA1CON2_OPA1NCH_SIZE                    equ 0003h
OPA1CON2_OPA1NCH_LENGTH                  equ 0003h
OPA1CON2_OPA1NCH_MASK                    equ 0070h
OPA1CON2_OPA1PCH0_POSN                   equ 0000h
OPA1CON2_OPA1PCH0_POSITION               equ 0000h
OPA1CON2_OPA1PCH0_SIZE                   equ 0001h
OPA1CON2_OPA1PCH0_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH0_MASK                   equ 0001h
OPA1CON2_OPA1PCH1_POSN                   equ 0001h
OPA1CON2_OPA1PCH1_POSITION               equ 0001h
OPA1CON2_OPA1PCH1_SIZE                   equ 0001h
OPA1CON2_OPA1PCH1_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH1_MASK                   equ 0002h
OPA1CON2_OPA1PCH2_POSN                   equ 0002h
OPA1CON2_OPA1PCH2_POSITION               equ 0002h
OPA1CON2_OPA1PCH2_SIZE                   equ 0001h
OPA1CON2_OPA1PCH2_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH2_MASK                   equ 0004h
OPA1CON2_OPA1NCH0_POSN                   equ 0004h
OPA1CON2_OPA1NCH0_POSITION               equ 0004h
OPA1CON2_OPA1NCH0_SIZE                   equ 0001h
OPA1CON2_OPA1NCH0_LENGTH                 equ 0001h
OPA1CON2_OPA1NCH0_MASK                   equ 0010h
OPA1CON2_OPA1NCH1_POSN                   equ 0005h
OPA1CON2_OPA1NCH1_POSITION               equ 0005h
OPA1CON2_OPA1NCH1_SIZE                   equ 0001h
OPA1CON2_OPA1NCH1_LENGTH                 equ 0001h
OPA1CON2_OPA1NCH1_MASK                   equ 0020h
OPA1CON2_OPA1NCH2_POSN                   equ 0006h
OPA1CON2_OPA1NCH2_POSITION               equ 0006h
OPA1CON2_OPA1NCH2_SIZE                   equ 0001h
OPA1CON2_OPA1NCH2_LENGTH                 equ 0001h
OPA1CON2_OPA1NCH2_MASK                   equ 0040h

// Register: OPA1CON3
#define OPA1CON3 OPA1CON3
OPA1CON3                                 equ 00A6h
// bitfield definitions
OPA1CON3_PSS_POSN                        equ 0000h
OPA1CON3_PSS_POSITION                    equ 0000h
OPA1CON3_PSS_SIZE                        equ 0005h
OPA1CON3_PSS_LENGTH                      equ 0005h
OPA1CON3_PSS_MASK                        equ 001Fh
OPA1CON3_FMS_POSN                        equ 0006h
OPA1CON3_FMS_POSITION                    equ 0006h
OPA1CON3_FMS_SIZE                        equ 0002h
OPA1CON3_FMS_LENGTH                      equ 0002h
OPA1CON3_FMS_MASK                        equ 00C0h
OPA1CON3_PSS0_POSN                       equ 0000h
OPA1CON3_PSS0_POSITION                   equ 0000h
OPA1CON3_PSS0_SIZE                       equ 0001h
OPA1CON3_PSS0_LENGTH                     equ 0001h
OPA1CON3_PSS0_MASK                       equ 0001h
OPA1CON3_PSS1_POSN                       equ 0001h
OPA1CON3_PSS1_POSITION                   equ 0001h
OPA1CON3_PSS1_SIZE                       equ 0001h
OPA1CON3_PSS1_LENGTH                     equ 0001h
OPA1CON3_PSS1_MASK                       equ 0002h
OPA1CON3_FMS0_POSN                       equ 0006h
OPA1CON3_FMS0_POSITION                   equ 0006h
OPA1CON3_FMS0_SIZE                       equ 0001h
OPA1CON3_FMS0_LENGTH                     equ 0001h
OPA1CON3_FMS0_MASK                       equ 0040h
OPA1CON3_FMS1_POSN                       equ 0007h
OPA1CON3_FMS1_POSITION                   equ 0007h
OPA1CON3_FMS1_SIZE                       equ 0001h
OPA1CON3_FMS1_LENGTH                     equ 0001h
OPA1CON3_FMS1_MASK                       equ 0080h
OPA1CON3_OPA1PSS_POSN                    equ 0000h
OPA1CON3_OPA1PSS_POSITION                equ 0000h
OPA1CON3_OPA1PSS_SIZE                    equ 0005h
OPA1CON3_OPA1PSS_LENGTH                  equ 0005h
OPA1CON3_OPA1PSS_MASK                    equ 001Fh
OPA1CON3_OPA1FMS_POSN                    equ 0006h
OPA1CON3_OPA1FMS_POSITION                equ 0006h
OPA1CON3_OPA1FMS_SIZE                    equ 0002h
OPA1CON3_OPA1FMS_LENGTH                  equ 0002h
OPA1CON3_OPA1FMS_MASK                    equ 00C0h
OPA1CON3_OPA1PSS0_POSN                   equ 0000h
OPA1CON3_OPA1PSS0_POSITION               equ 0000h
OPA1CON3_OPA1PSS0_SIZE                   equ 0001h
OPA1CON3_OPA1PSS0_LENGTH                 equ 0001h
OPA1CON3_OPA1PSS0_MASK                   equ 0001h
OPA1CON3_OPA1PSS1_POSN                   equ 0001h
OPA1CON3_OPA1PSS1_POSITION               equ 0001h
OPA1CON3_OPA1PSS1_SIZE                   equ 0001h
OPA1CON3_OPA1PSS1_LENGTH                 equ 0001h
OPA1CON3_OPA1PSS1_MASK                   equ 0002h
OPA1CON3_OPA1FMS0_POSN                   equ 0006h
OPA1CON3_OPA1FMS0_POSITION               equ 0006h
OPA1CON3_OPA1FMS0_SIZE                   equ 0001h
OPA1CON3_OPA1FMS0_LENGTH                 equ 0001h
OPA1CON3_OPA1FMS0_MASK                   equ 0040h
OPA1CON3_OPA1FMS1_POSN                   equ 0007h
OPA1CON3_OPA1FMS1_POSITION               equ 0007h
OPA1CON3_OPA1FMS1_SIZE                   equ 0001h
OPA1CON3_OPA1FMS1_LENGTH                 equ 0001h
OPA1CON3_OPA1FMS1_MASK                   equ 0080h

// Register: OPA1HWC
#define OPA1HWC OPA1HWC
OPA1HWC                                  equ 00A7h
// bitfield definitions
OPA1HWC_HWCL_POSN                        equ 0000h
OPA1HWC_HWCL_POSITION                    equ 0000h
OPA1HWC_HWCL_SIZE                        equ 0003h
OPA1HWC_HWCL_LENGTH                      equ 0003h
OPA1HWC_HWCL_MASK                        equ 0007h
OPA1HWC_ORPOL_POSN                       equ 0003h
OPA1HWC_ORPOL_POSITION                   equ 0003h
OPA1HWC_ORPOL_SIZE                       equ 0001h
OPA1HWC_ORPOL_LENGTH                     equ 0001h
OPA1HWC_ORPOL_MASK                       equ 0008h
OPA1HWC_HWCH_POSN                        equ 0004h
OPA1HWC_HWCH_POSITION                    equ 0004h
OPA1HWC_HWCH_SIZE                        equ 0003h
OPA1HWC_HWCH_LENGTH                      equ 0003h
OPA1HWC_HWCH_MASK                        equ 0070h
OPA1HWC_OREN_POSN                        equ 0007h
OPA1HWC_OREN_POSITION                    equ 0007h
OPA1HWC_OREN_SIZE                        equ 0001h
OPA1HWC_OREN_LENGTH                      equ 0001h
OPA1HWC_OREN_MASK                        equ 0080h
OPA1HWC_HWCL0_POSN                       equ 0000h
OPA1HWC_HWCL0_POSITION                   equ 0000h
OPA1HWC_HWCL0_SIZE                       equ 0001h
OPA1HWC_HWCL0_LENGTH                     equ 0001h
OPA1HWC_HWCL0_MASK                       equ 0001h
OPA1HWC_HWCL1_POSN                       equ 0001h
OPA1HWC_HWCL1_POSITION                   equ 0001h
OPA1HWC_HWCL1_SIZE                       equ 0001h
OPA1HWC_HWCL1_LENGTH                     equ 0001h
OPA1HWC_HWCL1_MASK                       equ 0002h
OPA1HWC_HWCL2_POSN                       equ 0002h
OPA1HWC_HWCL2_POSITION                   equ 0002h
OPA1HWC_HWCL2_SIZE                       equ 0001h
OPA1HWC_HWCL2_LENGTH                     equ 0001h
OPA1HWC_HWCL2_MASK                       equ 0004h
OPA1HWC_HWCH0_POSN                       equ 0004h
OPA1HWC_HWCH0_POSITION                   equ 0004h
OPA1HWC_HWCH0_SIZE                       equ 0001h
OPA1HWC_HWCH0_LENGTH                     equ 0001h
OPA1HWC_HWCH0_MASK                       equ 0010h
OPA1HWC_HWCH1_POSN                       equ 0005h
OPA1HWC_HWCH1_POSITION                   equ 0005h
OPA1HWC_HWCH1_SIZE                       equ 0001h
OPA1HWC_HWCH1_LENGTH                     equ 0001h
OPA1HWC_HWCH1_MASK                       equ 0020h
OPA1HWC_HWCH2_POSN                       equ 0006h
OPA1HWC_HWCH2_POSITION                   equ 0006h
OPA1HWC_HWCH2_SIZE                       equ 0001h
OPA1HWC_HWCH2_LENGTH                     equ 0001h
OPA1HWC_HWCH2_MASK                       equ 0040h
OPA1HWC_OPA1HWCL_POSN                    equ 0000h
OPA1HWC_OPA1HWCL_POSITION                equ 0000h
OPA1HWC_OPA1HWCL_SIZE                    equ 0003h
OPA1HWC_OPA1HWCL_LENGTH                  equ 0003h
OPA1HWC_OPA1HWCL_MASK                    equ 0007h
OPA1HWC_OPA1ORPOL_POSN                   equ 0003h
OPA1HWC_OPA1ORPOL_POSITION               equ 0003h
OPA1HWC_OPA1ORPOL_SIZE                   equ 0001h
OPA1HWC_OPA1ORPOL_LENGTH                 equ 0001h
OPA1HWC_OPA1ORPOL_MASK                   equ 0008h
OPA1HWC_OPA1HWCH_POSN                    equ 0004h
OPA1HWC_OPA1HWCH_POSITION                equ 0004h
OPA1HWC_OPA1HWCH_SIZE                    equ 0003h
OPA1HWC_OPA1HWCH_LENGTH                  equ 0003h
OPA1HWC_OPA1HWCH_MASK                    equ 0070h
OPA1HWC_OPA1OREN_POSN                    equ 0007h
OPA1HWC_OPA1OREN_POSITION                equ 0007h
OPA1HWC_OPA1OREN_SIZE                    equ 0001h
OPA1HWC_OPA1OREN_LENGTH                  equ 0001h
OPA1HWC_OPA1OREN_MASK                    equ 0080h
OPA1HWC_OPA1HWCL0_POSN                   equ 0000h
OPA1HWC_OPA1HWCL0_POSITION               equ 0000h
OPA1HWC_OPA1HWCL0_SIZE                   equ 0001h
OPA1HWC_OPA1HWCL0_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCL0_MASK                   equ 0001h
OPA1HWC_OPA1HWCL1_POSN                   equ 0001h
OPA1HWC_OPA1HWCL1_POSITION               equ 0001h
OPA1HWC_OPA1HWCL1_SIZE                   equ 0001h
OPA1HWC_OPA1HWCL1_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCL1_MASK                   equ 0002h
OPA1HWC_OPA1HWCL2_POSN                   equ 0002h
OPA1HWC_OPA1HWCL2_POSITION               equ 0002h
OPA1HWC_OPA1HWCL2_SIZE                   equ 0001h
OPA1HWC_OPA1HWCL2_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCL2_MASK                   equ 0004h
OPA1HWC_OPA1HWCH0_POSN                   equ 0004h
OPA1HWC_OPA1HWCH0_POSITION               equ 0004h
OPA1HWC_OPA1HWCH0_SIZE                   equ 0001h
OPA1HWC_OPA1HWCH0_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCH0_MASK                   equ 0010h
OPA1HWC_OPA1HWCH1_POSN                   equ 0005h
OPA1HWC_OPA1HWCH1_POSITION               equ 0005h
OPA1HWC_OPA1HWCH1_SIZE                   equ 0001h
OPA1HWC_OPA1HWCH1_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCH1_MASK                   equ 0020h
OPA1HWC_OPA1HWCH2_POSN                   equ 0006h
OPA1HWC_OPA1HWCH2_POSITION               equ 0006h
OPA1HWC_OPA1HWCH2_SIZE                   equ 0001h
OPA1HWC_OPA1HWCH2_LENGTH                 equ 0001h
OPA1HWC_OPA1HWCH2_MASK                   equ 0040h

// Register: OPA1OFFSET
#define OPA1OFFSET OPA1OFFSET
OPA1OFFSET                               equ 00A8h
// bitfield definitions
OPA1OFFSET_OFFSET_POSN                   equ 0000h
OPA1OFFSET_OFFSET_POSITION               equ 0000h
OPA1OFFSET_OFFSET_SIZE                   equ 0008h
OPA1OFFSET_OFFSET_LENGTH                 equ 0008h
OPA1OFFSET_OFFSET_MASK                   equ 00FFh
OPA1OFFSET_OFFSET0_POSN                  equ 0000h
OPA1OFFSET_OFFSET0_POSITION              equ 0000h
OPA1OFFSET_OFFSET0_SIZE                  equ 0001h
OPA1OFFSET_OFFSET0_LENGTH                equ 0001h
OPA1OFFSET_OFFSET0_MASK                  equ 0001h
OPA1OFFSET_OFFSET1_POSN                  equ 0001h
OPA1OFFSET_OFFSET1_POSITION              equ 0001h
OPA1OFFSET_OFFSET1_SIZE                  equ 0001h
OPA1OFFSET_OFFSET1_LENGTH                equ 0001h
OPA1OFFSET_OFFSET1_MASK                  equ 0002h
OPA1OFFSET_OFFSET2_POSN                  equ 0002h
OPA1OFFSET_OFFSET2_POSITION              equ 0002h
OPA1OFFSET_OFFSET2_SIZE                  equ 0001h
OPA1OFFSET_OFFSET2_LENGTH                equ 0001h
OPA1OFFSET_OFFSET2_MASK                  equ 0004h
OPA1OFFSET_OFFSET3_POSN                  equ 0003h
OPA1OFFSET_OFFSET3_POSITION              equ 0003h
OPA1OFFSET_OFFSET3_SIZE                  equ 0001h
OPA1OFFSET_OFFSET3_LENGTH                equ 0001h
OPA1OFFSET_OFFSET3_MASK                  equ 0008h
OPA1OFFSET_OFFSET4_POSN                  equ 0004h
OPA1OFFSET_OFFSET4_POSITION              equ 0004h
OPA1OFFSET_OFFSET4_SIZE                  equ 0001h
OPA1OFFSET_OFFSET4_LENGTH                equ 0001h
OPA1OFFSET_OFFSET4_MASK                  equ 0010h
OPA1OFFSET_OFFSET5_POSN                  equ 0005h
OPA1OFFSET_OFFSET5_POSITION              equ 0005h
OPA1OFFSET_OFFSET5_SIZE                  equ 0001h
OPA1OFFSET_OFFSET5_LENGTH                equ 0001h
OPA1OFFSET_OFFSET5_MASK                  equ 0020h
OPA1OFFSET_OFFSET6_POSN                  equ 0006h
OPA1OFFSET_OFFSET6_POSITION              equ 0006h
OPA1OFFSET_OFFSET6_SIZE                  equ 0001h
OPA1OFFSET_OFFSET6_LENGTH                equ 0001h
OPA1OFFSET_OFFSET6_MASK                  equ 0040h
OPA1OFFSET_OFFSET7_POSN                  equ 0007h
OPA1OFFSET_OFFSET7_POSITION              equ 0007h
OPA1OFFSET_OFFSET7_SIZE                  equ 0001h
OPA1OFFSET_OFFSET7_LENGTH                equ 0001h
OPA1OFFSET_OFFSET7_MASK                  equ 0080h
OPA1OFFSET_OPA1OFFSET_POSN               equ 0000h
OPA1OFFSET_OPA1OFFSET_POSITION           equ 0000h
OPA1OFFSET_OPA1OFFSET_SIZE               equ 0008h
OPA1OFFSET_OPA1OFFSET_LENGTH             equ 0008h
OPA1OFFSET_OPA1OFFSET_MASK               equ 00FFh
OPA1OFFSET_OPA1OFFSET0_POSN              equ 0000h
OPA1OFFSET_OPA1OFFSET0_POSITION          equ 0000h
OPA1OFFSET_OPA1OFFSET0_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET0_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET0_MASK              equ 0001h
OPA1OFFSET_OPA1OFFSET1_POSN              equ 0001h
OPA1OFFSET_OPA1OFFSET1_POSITION          equ 0001h
OPA1OFFSET_OPA1OFFSET1_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET1_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET1_MASK              equ 0002h
OPA1OFFSET_OPA1OFFSET2_POSN              equ 0002h
OPA1OFFSET_OPA1OFFSET2_POSITION          equ 0002h
OPA1OFFSET_OPA1OFFSET2_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET2_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET2_MASK              equ 0004h
OPA1OFFSET_OPA1OFFSET3_POSN              equ 0003h
OPA1OFFSET_OPA1OFFSET3_POSITION          equ 0003h
OPA1OFFSET_OPA1OFFSET3_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET3_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET3_MASK              equ 0008h
OPA1OFFSET_OPA1OFFSET4_POSN              equ 0004h
OPA1OFFSET_OPA1OFFSET4_POSITION          equ 0004h
OPA1OFFSET_OPA1OFFSET4_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET4_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET4_MASK              equ 0010h
OPA1OFFSET_OPA1OFFSET5_POSN              equ 0005h
OPA1OFFSET_OPA1OFFSET5_POSITION          equ 0005h
OPA1OFFSET_OPA1OFFSET5_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET5_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET5_MASK              equ 0020h
OPA1OFFSET_OPA1OFFSET6_POSN              equ 0006h
OPA1OFFSET_OPA1OFFSET6_POSITION          equ 0006h
OPA1OFFSET_OPA1OFFSET6_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET6_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET6_MASK              equ 0040h
OPA1OFFSET_OPA1OFFSET7_POSN              equ 0007h
OPA1OFFSET_OPA1OFFSET7_POSITION          equ 0007h
OPA1OFFSET_OPA1OFFSET7_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET7_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET7_MASK              equ 0080h

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
OPA1ORS                                  equ 00A9h
// bitfield definitions
OPA1ORS_ORS_POSN                         equ 0000h
OPA1ORS_ORS_POSITION                     equ 0000h
OPA1ORS_ORS_SIZE                         equ 0008h
OPA1ORS_ORS_LENGTH                       equ 0008h
OPA1ORS_ORS_MASK                         equ 00FFh
OPA1ORS_ORS0_POSN                        equ 0000h
OPA1ORS_ORS0_POSITION                    equ 0000h
OPA1ORS_ORS0_SIZE                        equ 0001h
OPA1ORS_ORS0_LENGTH                      equ 0001h
OPA1ORS_ORS0_MASK                        equ 0001h
OPA1ORS_ORS1_POSN                        equ 0001h
OPA1ORS_ORS1_POSITION                    equ 0001h
OPA1ORS_ORS1_SIZE                        equ 0001h
OPA1ORS_ORS1_LENGTH                      equ 0001h
OPA1ORS_ORS1_MASK                        equ 0002h
OPA1ORS_ORS2_POSN                        equ 0002h
OPA1ORS_ORS2_POSITION                    equ 0002h
OPA1ORS_ORS2_SIZE                        equ 0001h
OPA1ORS_ORS2_LENGTH                      equ 0001h
OPA1ORS_ORS2_MASK                        equ 0004h
OPA1ORS_ORS3_POSN                        equ 0003h
OPA1ORS_ORS3_POSITION                    equ 0003h
OPA1ORS_ORS3_SIZE                        equ 0001h
OPA1ORS_ORS3_LENGTH                      equ 0001h
OPA1ORS_ORS3_MASK                        equ 0008h
OPA1ORS_ORS4_POSN                        equ 0004h
OPA1ORS_ORS4_POSITION                    equ 0004h
OPA1ORS_ORS4_SIZE                        equ 0001h
OPA1ORS_ORS4_LENGTH                      equ 0001h
OPA1ORS_ORS4_MASK                        equ 0010h
OPA1ORS_OPA1ORS_POSN                     equ 0000h
OPA1ORS_OPA1ORS_POSITION                 equ 0000h
OPA1ORS_OPA1ORS_SIZE                     equ 0008h
OPA1ORS_OPA1ORS_LENGTH                   equ 0008h
OPA1ORS_OPA1ORS_MASK                     equ 00FFh
OPA1ORS_OPA1ORS0_POSN                    equ 0000h
OPA1ORS_OPA1ORS0_POSITION                equ 0000h
OPA1ORS_OPA1ORS0_SIZE                    equ 0001h
OPA1ORS_OPA1ORS0_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS0_MASK                    equ 0001h
OPA1ORS_OPA1ORS1_POSN                    equ 0001h
OPA1ORS_OPA1ORS1_POSITION                equ 0001h
OPA1ORS_OPA1ORS1_SIZE                    equ 0001h
OPA1ORS_OPA1ORS1_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS1_MASK                    equ 0002h
OPA1ORS_OPA1ORS2_POSN                    equ 0002h
OPA1ORS_OPA1ORS2_POSITION                equ 0002h
OPA1ORS_OPA1ORS2_SIZE                    equ 0001h
OPA1ORS_OPA1ORS2_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS2_MASK                    equ 0004h
OPA1ORS_OPA1ORS3_POSN                    equ 0003h
OPA1ORS_OPA1ORS3_POSITION                equ 0003h
OPA1ORS_OPA1ORS3_SIZE                    equ 0001h
OPA1ORS_OPA1ORS3_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS3_MASK                    equ 0008h
OPA1ORS_OPA1ORS4_POSN                    equ 0004h
OPA1ORS_OPA1ORS4_POSITION                equ 0004h
OPA1ORS_OPA1ORS4_SIZE                    equ 0001h
OPA1ORS_OPA1ORS4_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS4_MASK                    equ 0010h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 00ACh
// bitfield definitions
ACTCON_ORS_POSN                          equ 0001h
ACTCON_ORS_POSITION                      equ 0001h
ACTCON_ORS_SIZE                          equ 0001h
ACTCON_ORS_LENGTH                        equ 0001h
ACTCON_ORS_MASK                          equ 0002h
ACTCON_LOCK_POSN                         equ 0003h
ACTCON_LOCK_POSITION                     equ 0003h
ACTCON_LOCK_SIZE                         equ 0001h
ACTCON_LOCK_LENGTH                       equ 0001h
ACTCON_LOCK_MASK                         equ 0008h
ACTCON_UD_POSN                           equ 0006h
ACTCON_UD_POSITION                       equ 0006h
ACTCON_UD_SIZE                           equ 0001h
ACTCON_UD_LENGTH                         equ 0001h
ACTCON_UD_MASK                           equ 0040h
ACTCON_EN_POSN                           equ 0007h
ACTCON_EN_POSITION                       equ 0007h
ACTCON_EN_SIZE                           equ 0001h
ACTCON_EN_LENGTH                         equ 0001h
ACTCON_EN_MASK                           equ 0080h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

