GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0261h
// bitfield definitions
CLCIN0PPS_PIN_POSN                       equ 0000h
CLCIN0PPS_PIN_POSITION                   equ 0000h
CLCIN0PPS_PIN_SIZE                       equ 0003h
CLCIN0PPS_PIN_LENGTH                     equ 0003h
CLCIN0PPS_PIN_MASK                       equ 0007h
CLCIN0PPS_PORT_POSN                      equ 0003h
CLCIN0PPS_PORT_POSITION                  equ 0003h
CLCIN0PPS_PORT_SIZE                      equ 0003h
CLCIN0PPS_PORT_LENGTH                    equ 0003h
CLCIN0PPS_PORT_MASK                      equ 0038h
CLCIN0PPS_CLCIN0PPS0_POSN                equ 0000h
CLCIN0PPS_CLCIN0PPS0_POSITION            equ 0000h
CLCIN0PPS_CLCIN0PPS0_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS0_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS0_MASK                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSN                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSITION            equ 0001h
CLCIN0PPS_CLCIN0PPS1_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS1_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS1_MASK                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSN                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSITION            equ 0002h
CLCIN0PPS_CLCIN0PPS2_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS2_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS2_MASK                equ 0004h
CLCIN0PPS_CLCIN0PPS3_POSN                equ 0003h
CLCIN0PPS_CLCIN0PPS3_POSITION            equ 0003h
CLCIN0PPS_CLCIN0PPS3_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS3_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS3_MASK                equ 0008h
CLCIN0PPS_CLCIN0PPS4_POSN                equ 0004h
CLCIN0PPS_CLCIN0PPS4_POSITION            equ 0004h
CLCIN0PPS_CLCIN0PPS4_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS4_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS4_MASK                equ 0010h
CLCIN0PPS_CLCIN0PPS5_POSN                equ 0005h
CLCIN0PPS_CLCIN0PPS5_POSITION            equ 0005h
CLCIN0PPS_CLCIN0PPS5_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS5_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS5_MASK                equ 0020h
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0006h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0006h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 003Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0262h
// bitfield definitions
CLCIN1PPS_PIN_POSN                       equ 0000h
CLCIN1PPS_PIN_POSITION                   equ 0000h
CLCIN1PPS_PIN_SIZE                       equ 0003h
CLCIN1PPS_PIN_LENGTH                     equ 0003h
CLCIN1PPS_PIN_MASK                       equ 0007h
CLCIN1PPS_PORT_POSN                      equ 0003h
CLCIN1PPS_PORT_POSITION                  equ 0003h
CLCIN1PPS_PORT_SIZE                      equ 0003h
CLCIN1PPS_PORT_LENGTH                    equ 0003h
CLCIN1PPS_PORT_MASK                      equ 0038h
CLCIN1PPS_CLCIN1PPS0_POSN                equ 0000h
CLCIN1PPS_CLCIN1PPS0_POSITION            equ 0000h
CLCIN1PPS_CLCIN1PPS0_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS0_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS0_MASK                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSN                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSITION            equ 0001h
CLCIN1PPS_CLCIN1PPS1_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS1_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS1_MASK                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSN                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSITION            equ 0002h
CLCIN1PPS_CLCIN1PPS2_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS2_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS2_MASK                equ 0004h
CLCIN1PPS_CLCIN1PPS3_POSN                equ 0003h
CLCIN1PPS_CLCIN1PPS3_POSITION            equ 0003h
CLCIN1PPS_CLCIN1PPS3_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS3_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS3_MASK                equ 0008h
CLCIN1PPS_CLCIN1PPS4_POSN                equ 0004h
CLCIN1PPS_CLCIN1PPS4_POSITION            equ 0004h
CLCIN1PPS_CLCIN1PPS4_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS4_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS4_MASK                equ 0010h
CLCIN1PPS_CLCIN1PPS5_POSN                equ 0005h
CLCIN1PPS_CLCIN1PPS5_POSITION            equ 0005h
CLCIN1PPS_CLCIN1PPS5_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS5_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS5_MASK                equ 0020h
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0006h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0006h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 003Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0263h
// bitfield definitions
CLCIN2PPS_PIN_POSN                       equ 0000h
CLCIN2PPS_PIN_POSITION                   equ 0000h
CLCIN2PPS_PIN_SIZE                       equ 0003h
CLCIN2PPS_PIN_LENGTH                     equ 0003h
CLCIN2PPS_PIN_MASK                       equ 0007h
CLCIN2PPS_PORT_POSN                      equ 0003h
CLCIN2PPS_PORT_POSITION                  equ 0003h
CLCIN2PPS_PORT_SIZE                      equ 0003h
CLCIN2PPS_PORT_LENGTH                    equ 0003h
CLCIN2PPS_PORT_MASK                      equ 0038h
CLCIN2PPS_CLCIN2PPS0_POSN                equ 0000h
CLCIN2PPS_CLCIN2PPS0_POSITION            equ 0000h
CLCIN2PPS_CLCIN2PPS0_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS0_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS0_MASK                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSN                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSITION            equ 0001h
CLCIN2PPS_CLCIN2PPS1_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS1_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS1_MASK                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSN                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSITION            equ 0002h
CLCIN2PPS_CLCIN2PPS2_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS2_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS2_MASK                equ 0004h
CLCIN2PPS_CLCIN2PPS3_POSN                equ 0003h
CLCIN2PPS_CLCIN2PPS3_POSITION            equ 0003h
CLCIN2PPS_CLCIN2PPS3_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS3_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS3_MASK                equ 0008h
CLCIN2PPS_CLCIN2PPS4_POSN                equ 0004h
CLCIN2PPS_CLCIN2PPS4_POSITION            equ 0004h
CLCIN2PPS_CLCIN2PPS4_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS4_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS4_MASK                equ 0010h
CLCIN2PPS_CLCIN2PPS5_POSN                equ 0005h
CLCIN2PPS_CLCIN2PPS5_POSITION            equ 0005h
CLCIN2PPS_CLCIN2PPS5_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS5_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS5_MASK                equ 0020h
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0006h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0006h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 003Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0264h
// bitfield definitions
CLCIN3PPS_PIN_POSN                       equ 0000h
CLCIN3PPS_PIN_POSITION                   equ 0000h
CLCIN3PPS_PIN_SIZE                       equ 0003h
CLCIN3PPS_PIN_LENGTH                     equ 0003h
CLCIN3PPS_PIN_MASK                       equ 0007h
CLCIN3PPS_PORT_POSN                      equ 0003h
CLCIN3PPS_PORT_POSITION                  equ 0003h
CLCIN3PPS_PORT_SIZE                      equ 0003h
CLCIN3PPS_PORT_LENGTH                    equ 0003h
CLCIN3PPS_PORT_MASK                      equ 0038h
CLCIN3PPS_CLCIN3PPS0_POSN                equ 0000h
CLCIN3PPS_CLCIN3PPS0_POSITION            equ 0000h
CLCIN3PPS_CLCIN3PPS0_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS0_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS0_MASK                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSN                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSITION            equ 0001h
CLCIN3PPS_CLCIN3PPS1_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS1_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS1_MASK                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSN                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSITION            equ 0002h
CLCIN3PPS_CLCIN3PPS2_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS2_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS2_MASK                equ 0004h
CLCIN3PPS_CLCIN3PPS3_POSN                equ 0003h
CLCIN3PPS_CLCIN3PPS3_POSITION            equ 0003h
CLCIN3PPS_CLCIN3PPS3_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS3_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS3_MASK                equ 0008h
CLCIN3PPS_CLCIN3PPS4_POSN                equ 0004h
CLCIN3PPS_CLCIN3PPS4_POSITION            equ 0004h
CLCIN3PPS_CLCIN3PPS4_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS4_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS4_MASK                equ 0010h
CLCIN3PPS_CLCIN3PPS5_POSN                equ 0005h
CLCIN3PPS_CLCIN3PPS5_POSITION            equ 0005h
CLCIN3PPS_CLCIN3PPS5_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS5_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS5_MASK                equ 0020h
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0006h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0006h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 003Fh

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 0269h
// bitfield definitions
ADACTPPS_PIN_POSN                        equ 0000h
ADACTPPS_PIN_POSITION                    equ 0000h
ADACTPPS_PIN_SIZE                        equ 0003h
ADACTPPS_PIN_LENGTH                      equ 0003h
ADACTPPS_PIN_MASK                        equ 0007h
ADACTPPS_PORT_POSN                       equ 0003h
ADACTPPS_PORT_POSITION                   equ 0003h
ADACTPPS_PORT_SIZE                       equ 0003h
ADACTPPS_PORT_LENGTH                     equ 0003h
ADACTPPS_PORT_MASK                       equ 0038h
ADACTPPS_ADACTPPS0_POSN                  equ 0000h
ADACTPPS_ADACTPPS0_POSITION              equ 0000h
ADACTPPS_ADACTPPS0_SIZE                  equ 0001h
ADACTPPS_ADACTPPS0_LENGTH                equ 0001h
ADACTPPS_ADACTPPS0_MASK                  equ 0001h
ADACTPPS_ADACTPPS1_POSN                  equ 0001h
ADACTPPS_ADACTPPS1_POSITION              equ 0001h
ADACTPPS_ADACTPPS1_SIZE                  equ 0001h
ADACTPPS_ADACTPPS1_LENGTH                equ 0001h
ADACTPPS_ADACTPPS1_MASK                  equ 0002h
ADACTPPS_ADACTPPS2_POSN                  equ 0002h
ADACTPPS_ADACTPPS2_POSITION              equ 0002h
ADACTPPS_ADACTPPS2_SIZE                  equ 0001h
ADACTPPS_ADACTPPS2_LENGTH                equ 0001h
ADACTPPS_ADACTPPS2_MASK                  equ 0004h
ADACTPPS_ADACTPPS3_POSN                  equ 0003h
ADACTPPS_ADACTPPS3_POSITION              equ 0003h
ADACTPPS_ADACTPPS3_SIZE                  equ 0001h
ADACTPPS_ADACTPPS3_LENGTH                equ 0001h
ADACTPPS_ADACTPPS3_MASK                  equ 0008h
ADACTPPS_ADACTPPS4_POSN                  equ 0004h
ADACTPPS_ADACTPPS4_POSITION              equ 0004h
ADACTPPS_ADACTPPS4_SIZE                  equ 0001h
ADACTPPS_ADACTPPS4_LENGTH                equ 0001h
ADACTPPS_ADACTPPS4_MASK                  equ 0010h
ADACTPPS_ADACTPPS5_POSN                  equ 0005h
ADACTPPS_ADACTPPS5_POSITION              equ 0005h
ADACTPPS_ADACTPPS5_SIZE                  equ 0001h
ADACTPPS_ADACTPPS5_LENGTH                equ 0001h
ADACTPPS_ADACTPPS5_MASK                  equ 0020h
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0006h
ADACTPPS_ADACTPPS_LENGTH                 equ 0006h
ADACTPPS_ADACTPPS_MASK                   equ 003Fh

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
SPI1SCKPPS                               equ 026Ah
// bitfield definitions
SPI1SCKPPS_PIN_POSN                      equ 0000h
SPI1SCKPPS_PIN_POSITION                  equ 0000h
SPI1SCKPPS_PIN_SIZE                      equ 0003h
SPI1SCKPPS_PIN_LENGTH                    equ 0003h
SPI1SCKPPS_PIN_MASK                      equ 0007h
SPI1SCKPPS_PORT_POSN                     equ 0003h
SPI1SCKPPS_PORT_POSITION                 equ 0003h
SPI1SCKPPS_PORT_SIZE                     equ 0003h
SPI1SCKPPS_PORT_LENGTH                   equ 0003h
SPI1SCKPPS_PORT_MASK                     equ 0038h
SPI1SCKPPS_SPI1SCKPPS_POSN               equ 0000h
SPI1SCKPPS_SPI1SCKPPS_POSITION           equ 0000h
SPI1SCKPPS_SPI1SCKPPS_SIZE               equ 0006h
SPI1SCKPPS_SPI1SCKPPS_LENGTH             equ 0006h
SPI1SCKPPS_SPI1SCKPPS_MASK               equ 003Fh
SPI1SCKPPS_SPI1SCKPPS0_POSN              equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_POSITION          equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_MASK              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSN              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSITION          equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_MASK              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSN              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSITION          equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_MASK              equ 0004h
SPI1SCKPPS_SPI1SCKPPS3_POSN              equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_POSITION          equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_MASK              equ 0008h
SPI1SCKPPS_SPI1SCKPPS4_POSN              equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_POSITION          equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_MASK              equ 0010h
SPI1SCKPPS_SPI1SCKPPS5_POSN              equ 0005h
SPI1SCKPPS_SPI1SCKPPS5_POSITION          equ 0005h
SPI1SCKPPS_SPI1SCKPPS5_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS5_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS5_MASK              equ 0020h

