GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 04ACh
// bitfield definitions
PIE4_U1RXIE_POSN                         equ 0000h
PIE4_U1RXIE_POSITION                     equ 0000h
PIE4_U1RXIE_SIZE                         equ 0001h
PIE4_U1RXIE_LENGTH                       equ 0001h
PIE4_U1RXIE_MASK                         equ 0001h
PIE4_U1TXIE_POSN                         equ 0001h
PIE4_U1TXIE_POSITION                     equ 0001h
PIE4_U1TXIE_SIZE                         equ 0001h
PIE4_U1TXIE_LENGTH                       equ 0001h
PIE4_U1TXIE_MASK                         equ 0002h
PIE4_U1EIE_POSN                          equ 0002h
PIE4_U1EIE_POSITION                      equ 0002h
PIE4_U1EIE_SIZE                          equ 0001h
PIE4_U1EIE_LENGTH                        equ 0001h
PIE4_U1EIE_MASK                          equ 0004h
PIE4_U1IE_POSN                           equ 0003h
PIE4_U1IE_POSITION                       equ 0003h
PIE4_U1IE_SIZE                           equ 0001h
PIE4_U1IE_LENGTH                         equ 0001h
PIE4_U1IE_MASK                           equ 0008h
PIE4_TMR3IE_POSN                         equ 0004h
PIE4_TMR3IE_POSITION                     equ 0004h
PIE4_TMR3IE_SIZE                         equ 0001h
PIE4_TMR3IE_LENGTH                       equ 0001h
PIE4_TMR3IE_MASK                         equ 0010h
PIE4_TMR3GIE_POSN                        equ 0005h
PIE4_TMR3GIE_POSITION                    equ 0005h
PIE4_TMR3GIE_SIZE                        equ 0001h
PIE4_TMR3GIE_LENGTH                      equ 0001h
PIE4_TMR3GIE_MASK                        equ 0020h
PIE4_PWM1PIE_POSN                        equ 0006h
PIE4_PWM1PIE_POSITION                    equ 0006h
PIE4_PWM1PIE_SIZE                        equ 0001h
PIE4_PWM1PIE_LENGTH                      equ 0001h
PIE4_PWM1PIE_MASK                        equ 0040h
PIE4_PWM1IE_POSN                         equ 0007h
PIE4_PWM1IE_POSITION                     equ 0007h
PIE4_PWM1IE_SIZE                         equ 0001h
PIE4_PWM1IE_LENGTH                       equ 0001h
PIE4_PWM1IE_MASK                         equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 04ADh
// bitfield definitions
PIE5_SPI2RXIE_POSN                       equ 0000h
PIE5_SPI2RXIE_POSITION                   equ 0000h
PIE5_SPI2RXIE_SIZE                       equ 0001h
PIE5_SPI2RXIE_LENGTH                     equ 0001h
PIE5_SPI2RXIE_MASK                       equ 0001h
PIE5_SPI2TXIE_POSN                       equ 0001h
PIE5_SPI2TXIE_POSITION                   equ 0001h
PIE5_SPI2TXIE_SIZE                       equ 0001h
PIE5_SPI2TXIE_LENGTH                     equ 0001h
PIE5_SPI2TXIE_MASK                       equ 0002h
PIE5_SPI2IE_POSN                         equ 0002h
PIE5_SPI2IE_POSITION                     equ 0002h
PIE5_SPI2IE_SIZE                         equ 0001h
PIE5_SPI2IE_LENGTH                       equ 0001h
PIE5_SPI2IE_MASK                         equ 0004h
PIE5_C2IE_POSN                           equ 0004h
PIE5_C2IE_POSITION                       equ 0004h
PIE5_C2IE_SIZE                           equ 0001h
PIE5_C2IE_LENGTH                         equ 0001h
PIE5_C2IE_MASK                           equ 0010h
PIE5_CLC2IE_POSN                         equ 0005h
PIE5_CLC2IE_POSITION                     equ 0005h
PIE5_CLC2IE_SIZE                         equ 0001h
PIE5_CLC2IE_LENGTH                       equ 0001h
PIE5_CLC2IE_MASK                         equ 0020h
PIE5_PWM2PIE_POSN                        equ 0006h
PIE5_PWM2PIE_POSITION                    equ 0006h
PIE5_PWM2PIE_SIZE                        equ 0001h
PIE5_PWM2PIE_LENGTH                      equ 0001h
PIE5_PWM2PIE_MASK                        equ 0040h
PIE5_PWM2IE_POSN                         equ 0007h
PIE5_PWM2IE_POSITION                     equ 0007h
PIE5_PWM2IE_SIZE                         equ 0001h
PIE5_PWM2IE_LENGTH                       equ 0001h
PIE5_PWM2IE_MASK                         equ 0080h
PIE5_CM2IE_POSN                          equ 0004h
PIE5_CM2IE_POSITION                      equ 0004h
PIE5_CM2IE_SIZE                          equ 0001h
PIE5_CM2IE_LENGTH                        equ 0001h
PIE5_CM2IE_MASK                          equ 0010h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 04AEh
// bitfield definitions
PIE6_INT1IE_POSN                         equ 0000h
PIE6_INT1IE_POSITION                     equ 0000h
PIE6_INT1IE_SIZE                         equ 0001h
PIE6_INT1IE_LENGTH                       equ 0001h
PIE6_INT1IE_MASK                         equ 0001h
PIE6_CWG1IE_POSN                         equ 0002h
PIE6_CWG1IE_POSITION                     equ 0002h
PIE6_CWG1IE_SIZE                         equ 0001h
PIE6_CWG1IE_LENGTH                       equ 0001h
PIE6_CWG1IE_MASK                         equ 0004h
PIE6_NCO1IE_POSN                         equ 0003h
PIE6_NCO1IE_POSITION                     equ 0003h
PIE6_NCO1IE_SIZE                         equ 0001h
PIE6_NCO1IE_LENGTH                       equ 0001h
PIE6_NCO1IE_MASK                         equ 0008h
PIE6_DMA2SCNTIE_POSN                     equ 0004h
PIE6_DMA2SCNTIE_POSITION                 equ 0004h
PIE6_DMA2SCNTIE_SIZE                     equ 0001h
PIE6_DMA2SCNTIE_LENGTH                   equ 0001h
PIE6_DMA2SCNTIE_MASK                     equ 0010h
PIE6_DMA2DCNTIE_POSN                     equ 0005h
PIE6_DMA2DCNTIE_POSITION                 equ 0005h
PIE6_DMA2DCNTIE_SIZE                     equ 0001h
PIE6_DMA2DCNTIE_LENGTH                   equ 0001h
PIE6_DMA2DCNTIE_MASK                     equ 0020h
PIE6_DMA2ORIE_POSN                       equ 0006h
PIE6_DMA2ORIE_POSITION                   equ 0006h
PIE6_DMA2ORIE_SIZE                       equ 0001h
PIE6_DMA2ORIE_LENGTH                     equ 0001h
PIE6_DMA2ORIE_MASK                       equ 0040h
PIE6_DMA2AIE_POSN                        equ 0007h
PIE6_DMA2AIE_POSITION                    equ 0007h
PIE6_DMA2AIE_SIZE                        equ 0001h
PIE6_DMA2AIE_LENGTH                      equ 0001h
PIE6_DMA2AIE_MASK                        equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 04AFh
// bitfield definitions
PIE7_I2C1RXIE_POSN                       equ 0000h
PIE7_I2C1RXIE_POSITION                   equ 0000h
PIE7_I2C1RXIE_SIZE                       equ 0001h
PIE7_I2C1RXIE_LENGTH                     equ 0001h
PIE7_I2C1RXIE_MASK                       equ 0001h
PIE7_I2C1TXIE_POSN                       equ 0001h
PIE7_I2C1TXIE_POSITION                   equ 0001h
PIE7_I2C1TXIE_SIZE                       equ 0001h
PIE7_I2C1TXIE_LENGTH                     equ 0001h
PIE7_I2C1TXIE_MASK                       equ 0002h
PIE7_I2C1IE_POSN                         equ 0002h
PIE7_I2C1IE_POSITION                     equ 0002h
PIE7_I2C1IE_SIZE                         equ 0001h
PIE7_I2C1IE_LENGTH                       equ 0001h
PIE7_I2C1IE_MASK                         equ 0004h
PIE7_I2C1EIE_POSN                        equ 0003h
PIE7_I2C1EIE_POSITION                    equ 0003h
PIE7_I2C1EIE_SIZE                        equ 0001h
PIE7_I2C1EIE_LENGTH                      equ 0001h
PIE7_I2C1EIE_MASK                        equ 0008h
PIE7_CLC3IE_POSN                         equ 0005h
PIE7_CLC3IE_POSITION                     equ 0005h
PIE7_CLC3IE_SIZE                         equ 0001h
PIE7_CLC3IE_LENGTH                       equ 0001h
PIE7_CLC3IE_MASK                         equ 0020h
PIE7_PWM3PIE_POSN                        equ 0006h
PIE7_PWM3PIE_POSITION                    equ 0006h
PIE7_PWM3PIE_SIZE                        equ 0001h
PIE7_PWM3PIE_LENGTH                      equ 0001h
PIE7_PWM3PIE_MASK                        equ 0040h
PIE7_PWM3IE_POSN                         equ 0007h
PIE7_PWM3IE_POSITION                     equ 0007h
PIE7_PWM3IE_SIZE                         equ 0001h
PIE7_PWM3IE_LENGTH                       equ 0001h
PIE7_PWM3IE_MASK                         equ 0080h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 04B0h
// bitfield definitions
PIE8_U2RXIE_POSN                         equ 0000h
PIE8_U2RXIE_POSITION                     equ 0000h
PIE8_U2RXIE_SIZE                         equ 0001h
PIE8_U2RXIE_LENGTH                       equ 0001h
PIE8_U2RXIE_MASK                         equ 0001h
PIE8_U2TXIE_POSN                         equ 0001h
PIE8_U2TXIE_POSITION                     equ 0001h
PIE8_U2TXIE_SIZE                         equ 0001h
PIE8_U2TXIE_LENGTH                       equ 0001h
PIE8_U2TXIE_MASK                         equ 0002h
PIE8_U2EIE_POSN                          equ 0002h
PIE8_U2EIE_POSITION                      equ 0002h
PIE8_U2EIE_SIZE                          equ 0001h
PIE8_U2EIE_LENGTH                        equ 0001h
PIE8_U2EIE_MASK                          equ 0004h
PIE8_U2IE_POSN                           equ 0003h
PIE8_U2IE_POSITION                       equ 0003h
PIE8_U2IE_SIZE                           equ 0001h
PIE8_U2IE_LENGTH                         equ 0001h
PIE8_U2IE_MASK                           equ 0008h
PIE8_CLC4IE_POSN                         equ 0005h
PIE8_CLC4IE_POSITION                     equ 0005h
PIE8_CLC4IE_SIZE                         equ 0001h
PIE8_CLC4IE_LENGTH                       equ 0001h
PIE8_CLC4IE_MASK                         equ 0020h
PIE8_SCANIE_POSN                         equ 0007h
PIE8_SCANIE_POSITION                     equ 0007h
PIE8_SCANIE_SIZE                         equ 0001h
PIE8_SCANIE_LENGTH                       equ 0001h
PIE8_SCANIE_MASK                         equ 0080h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 04B1h
// bitfield definitions
PIE9_U3RXIE_POSN                         equ 0000h
PIE9_U3RXIE_POSITION                     equ 0000h
PIE9_U3RXIE_SIZE                         equ 0001h
PIE9_U3RXIE_LENGTH                       equ 0001h
PIE9_U3RXIE_MASK                         equ 0001h
PIE9_U3TXIE_POSN                         equ 0001h
PIE9_U3TXIE_POSITION                     equ 0001h
PIE9_U3TXIE_SIZE                         equ 0001h
PIE9_U3TXIE_LENGTH                       equ 0001h
PIE9_U3TXIE_MASK                         equ 0002h
PIE9_U3EIE_POSN                          equ 0002h
PIE9_U3EIE_POSITION                      equ 0002h
PIE9_U3EIE_SIZE                          equ 0001h
PIE9_U3EIE_LENGTH                        equ 0001h
PIE9_U3EIE_MASK                          equ 0004h
PIE9_U3IE_POSN                           equ 0003h
PIE9_U3IE_POSITION                       equ 0003h
PIE9_U3IE_SIZE                           equ 0001h
PIE9_U3IE_LENGTH                         equ 0001h
PIE9_U3IE_MASK                           equ 0008h
PIE9_DMA3SCNTIE_POSN                     equ 0004h
PIE9_DMA3SCNTIE_POSITION                 equ 0004h
PIE9_DMA3SCNTIE_SIZE                     equ 0001h
PIE9_DMA3SCNTIE_LENGTH                   equ 0001h
PIE9_DMA3SCNTIE_MASK                     equ 0010h
PIE9_DMA3DCNTIE_POSN                     equ 0005h
PIE9_DMA3DCNTIE_POSITION                 equ 0005h
PIE9_DMA3DCNTIE_SIZE                     equ 0001h
PIE9_DMA3DCNTIE_LENGTH                   equ 0001h
PIE9_DMA3DCNTIE_MASK                     equ 0020h
PIE9_DMA3ORIE_POSN                       equ 0006h
PIE9_DMA3ORIE_POSITION                   equ 0006h
PIE9_DMA3ORIE_SIZE                       equ 0001h
PIE9_DMA3ORIE_LENGTH                     equ 0001h
PIE9_DMA3ORIE_MASK                       equ 0040h
PIE9_DMA3AIE_POSN                        equ 0007h
PIE9_DMA3AIE_POSITION                    equ 0007h
PIE9_DMA3AIE_SIZE                        equ 0001h
PIE9_DMA3AIE_LENGTH                      equ 0001h
PIE9_DMA3AIE_MASK                        equ 0080h

// Register: PIE10
#define PIE10 PIE10
PIE10                                    equ 04B2h
// bitfield definitions
PIE10_INT2IE_POSN                        equ 0000h
PIE10_INT2IE_POSITION                    equ 0000h
PIE10_INT2IE_SIZE                        equ 0001h
PIE10_INT2IE_LENGTH                      equ 0001h
PIE10_INT2IE_MASK                        equ 0001h
PIE10_TMR4IE_POSN                        equ 0003h
PIE10_TMR4IE_POSITION                    equ 0003h
PIE10_TMR4IE_SIZE                        equ 0001h
PIE10_TMR4IE_LENGTH                      equ 0001h
PIE10_TMR4IE_MASK                        equ 0008h
PIE10_DMA4SCNTIE_POSN                    equ 0004h
PIE10_DMA4SCNTIE_POSITION                equ 0004h
PIE10_DMA4SCNTIE_SIZE                    equ 0001h
PIE10_DMA4SCNTIE_LENGTH                  equ 0001h
PIE10_DMA4SCNTIE_MASK                    equ 0010h
PIE10_DMA4DCNTIE_POSN                    equ 0005h
PIE10_DMA4DCNTIE_POSITION                equ 0005h
PIE10_DMA4DCNTIE_SIZE                    equ 0001h
PIE10_DMA4DCNTIE_LENGTH                  equ 0001h
PIE10_DMA4DCNTIE_MASK                    equ 0020h
PIE10_DMA4ORIE_POSN                      equ 0006h
PIE10_DMA4ORIE_POSITION                  equ 0006h
PIE10_DMA4ORIE_SIZE                      equ 0001h
PIE10_DMA4ORIE_LENGTH                    equ 0001h
PIE10_DMA4ORIE_MASK                      equ 0040h
PIE10_DMA4AIE_POSN                       equ 0007h
PIE10_DMA4AIE_POSITION                   equ 0007h
PIE10_DMA4AIE_SIZE                       equ 0001h
PIE10_DMA4AIE_LENGTH                     equ 0001h
PIE10_DMA4AIE_MASK                       equ 0080h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 04B3h
// bitfield definitions
PIR0_SWIF_POSN                           equ 0000h
PIR0_SWIF_POSITION                       equ 0000h
PIR0_SWIF_SIZE                           equ 0001h
PIR0_SWIF_LENGTH                         equ 0001h
PIR0_SWIF_MASK                           equ 0001h
PIR0_HLVDIF_POSN                         equ 0001h
PIR0_HLVDIF_POSITION                     equ 0001h
PIR0_HLVDIF_SIZE                         equ 0001h
PIR0_HLVDIF_LENGTH                       equ 0001h
PIR0_HLVDIF_MASK                         equ 0002h
PIR0_OSFIF_POSN                          equ 0002h
PIR0_OSFIF_POSITION                      equ 0002h
PIR0_OSFIF_SIZE                          equ 0001h
PIR0_OSFIF_LENGTH                        equ 0001h
PIR0_OSFIF_MASK                          equ 0004h
PIR0_CSWIF_POSN                          equ 0003h
PIR0_CSWIF_POSITION                      equ 0003h
PIR0_CSWIF_SIZE                          equ 0001h
PIR0_CSWIF_LENGTH                        equ 0001h
PIR0_CSWIF_MASK                          equ 0008h
PIR0_NVMIF_POSN                          equ 0004h
PIR0_NVMIF_POSITION                      equ 0004h
PIR0_NVMIF_SIZE                          equ 0001h
PIR0_NVMIF_LENGTH                        equ 0001h
PIR0_NVMIF_MASK                          equ 0010h
PIR0_CLC1IF_POSN                         equ 0005h
PIR0_CLC1IF_POSITION                     equ 0005h
PIR0_CLC1IF_SIZE                         equ 0001h
PIR0_CLC1IF_LENGTH                       equ 0001h
PIR0_CLC1IF_MASK                         equ 0020h
PIR0_CRCIF_POSN                          equ 0006h
PIR0_CRCIF_POSITION                      equ 0006h
PIR0_CRCIF_SIZE                          equ 0001h
PIR0_CRCIF_LENGTH                        equ 0001h
PIR0_CRCIF_MASK                          equ 0040h
PIR0_IOCIF_POSN                          equ 0007h
PIR0_IOCIF_POSITION                      equ 0007h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 04B4h
// bitfield definitions
PIR1_INT0IF_POSN                         equ 0000h
PIR1_INT0IF_POSITION                     equ 0000h
PIR1_INT0IF_SIZE                         equ 0001h
PIR1_INT0IF_LENGTH                       equ 0001h
PIR1_INT0IF_MASK                         equ 0001h
PIR1_ZCDIF_POSN                          equ 0001h
PIR1_ZCDIF_POSITION                      equ 0001h
PIR1_ZCDIF_SIZE                          equ 0001h
PIR1_ZCDIF_LENGTH                        equ 0001h
PIR1_ZCDIF_MASK                          equ 0002h
PIR1_ADIF_POSN                           equ 0002h
PIR1_ADIF_POSITION                       equ 0002h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0004h
PIR1_ACTIF_POSN                          equ 0003h
PIR1_ACTIF_POSITION                      equ 0003h
PIR1_ACTIF_SIZE                          equ 0001h
PIR1_ACTIF_LENGTH                        equ 0001h
PIR1_ACTIF_MASK                          equ 0008h
PIR1_C1IF_POSN                           equ 0004h
PIR1_C1IF_POSITION                       equ 0004h
PIR1_C1IF_SIZE                           equ 0001h
PIR1_C1IF_LENGTH                         equ 0001h
PIR1_C1IF_MASK                           equ 0010h
PIR1_SMT1IF_POSN                         equ 0005h
PIR1_SMT1IF_POSITION                     equ 0005h
PIR1_SMT1IF_SIZE                         equ 0001h
PIR1_SMT1IF_LENGTH                       equ 0001h
PIR1_SMT1IF_MASK                         equ 0020h
PIR1_SMT1PRAIF_POSN                      equ 0006h
PIR1_SMT1PRAIF_POSITION                  equ 0006h
PIR1_SMT1PRAIF_SIZE                      equ 0001h
PIR1_SMT1PRAIF_LENGTH                    equ 0001h
PIR1_SMT1PRAIF_MASK                      equ 0040h
PIR1_SMT1PWAIF_POSN                      equ 0007h
PIR1_SMT1PWAIF_POSITION                  equ 0007h
PIR1_SMT1PWAIF_SIZE                      equ 0001h
PIR1_SMT1PWAIF_LENGTH                    equ 0001h
PIR1_SMT1PWAIF_MASK                      equ 0080h
PIR1_CM1IF_POSN                          equ 0004h
PIR1_CM1IF_POSITION                      equ 0004h
PIR1_CM1IF_SIZE                          equ 0001h
PIR1_CM1IF_LENGTH                        equ 0001h
PIR1_CM1IF_MASK                          equ 0010h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 04B5h
// bitfield definitions
PIR2_ADTIF_POSN                          equ 0000h
PIR2_ADTIF_POSITION                      equ 0000h
PIR2_ADTIF_SIZE                          equ 0001h
PIR2_ADTIF_LENGTH                        equ 0001h
PIR2_ADTIF_MASK                          equ 0001h
PIR2_DMA1SCNTIF_POSN                     equ 0004h
PIR2_DMA1SCNTIF_POSITION                 equ 0004h
PIR2_DMA1SCNTIF_SIZE                     equ 0001h
PIR2_DMA1SCNTIF_LENGTH                   equ 0001h
PIR2_DMA1SCNTIF_MASK                     equ 0010h
PIR2_DMA1DCNTIF_POSN                     equ 0005h
PIR2_DMA1DCNTIF_POSITION                 equ 0005h
PIR2_DMA1DCNTIF_SIZE                     equ 0001h
PIR2_DMA1DCNTIF_LENGTH                   equ 0001h
PIR2_DMA1DCNTIF_MASK                     equ 0020h
PIR2_DMA1ORIF_POSN                       equ 0006h
PIR2_DMA1ORIF_POSITION                   equ 0006h
PIR2_DMA1ORIF_SIZE                       equ 0001h
PIR2_DMA1ORIF_LENGTH                     equ 0001h
PIR2_DMA1ORIF_MASK                       equ 0040h
PIR2_DMA1AIF_POSN                        equ 0007h
PIR2_DMA1AIF_POSITION                    equ 0007h
PIR2_DMA1AIF_SIZE                        equ 0001h
PIR2_DMA1AIF_LENGTH                      equ 0001h
PIR2_DMA1AIF_MASK                        equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 04B6h
// bitfield definitions
PIR3_SPI1RXIF_POSN                       equ 0000h
PIR3_SPI1RXIF_POSITION                   equ 0000h
PIR3_SPI1RXIF_SIZE                       equ 0001h
PIR3_SPI1RXIF_LENGTH                     equ 0001h
PIR3_SPI1RXIF_MASK                       equ 0001h
PIR3_SPI1TXIF_POSN                       equ 0001h
PIR3_SPI1TXIF_POSITION                   equ 0001h
PIR3_SPI1TXIF_SIZE                       equ 0001h
PIR3_SPI1TXIF_LENGTH                     equ 0001h
PIR3_SPI1TXIF_MASK                       equ 0002h
PIR3_SPI1IF_POSN                         equ 0002h
PIR3_SPI1IF_POSITION                     equ 0002h
PIR3_SPI1IF_SIZE                         equ 0001h
PIR3_SPI1IF_LENGTH                       equ 0001h
PIR3_SPI1IF_MASK                         equ 0004h
PIR3_TMR2IF_POSN                         equ 0003h
PIR3_TMR2IF_POSITION                     equ 0003h
PIR3_TMR2IF_SIZE                         equ 0001h
PIR3_TMR2IF_LENGTH                       equ 0001h
PIR3_TMR2IF_MASK                         equ 0008h
PIR3_TMR1IF_POSN                         equ 0004h
PIR3_TMR1IF_POSITION                     equ 0004h
PIR3_TMR1IF_SIZE                         equ 0001h
PIR3_TMR1IF_LENGTH                       equ 0001h
PIR3_TMR1IF_MASK                         equ 0010h
PIR3_TMR1GIF_POSN                        equ 0005h
PIR3_TMR1GIF_POSITION                    equ 0005h
PIR3_TMR1GIF_SIZE                        equ 0001h
PIR3_TMR1GIF_LENGTH                      equ 0001h
PIR3_TMR1GIF_MASK                        equ 0020h
PIR3_CCP1IF_POSN                         equ 0006h
PIR3_CCP1IF_POSITION                     equ 0006h
PIR3_CCP1IF_SIZE                         equ 0001h
PIR3_CCP1IF_LENGTH                       equ 0001h
PIR3_CCP1IF_MASK                         equ 0040h
PIR3_TMR0IF_POSN                         equ 0007h
PIR3_TMR0IF_POSITION                     equ 0007h
PIR3_TMR0IF_SIZE                         equ 0001h
PIR3_TMR0IF_LENGTH                       equ 0001h
PIR3_TMR0IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 04B7h
// bitfield definitions
PIR4_U1RXIF_POSN                         equ 0000h
PIR4_U1RXIF_POSITION                     equ 0000h
PIR4_U1RXIF_SIZE                         equ 0001h
PIR4_U1RXIF_LENGTH                       equ 0001h
PIR4_U1RXIF_MASK                         equ 0001h
PIR4_U1TXIF_POSN                         equ 0001h
PIR4_U1TXIF_POSITION                     equ 0001h
PIR4_U1TXIF_SIZE                         equ 0001h
PIR4_U1TXIF_LENGTH                       equ 0001h
PIR4_U1TXIF_MASK                         equ 0002h
PIR4_U1EIF_POSN                          equ 0002h
PIR4_U1EIF_POSITION                      equ 0002h
PIR4_U1EIF_SIZE                          equ 0001h
PIR4_U1EIF_LENGTH                        equ 0001h
PIR4_U1EIF_MASK                          equ 0004h
PIR4_U1IF_POSN                           equ 0003h
PIR4_U1IF_POSITION                       equ 0003h
PIR4_U1IF_SIZE                           equ 0001h
PIR4_U1IF_LENGTH                         equ 0001h
PIR4_U1IF_MASK                           equ 0008h
PIR4_TMR3IF_POSN                         equ 0004h
PIR4_TMR3IF_POSITION                     equ 0004h
PIR4_TMR3IF_SIZE                         equ 0001h
PIR4_TMR3IF_LENGTH                       equ 0001h
PIR4_TMR3IF_MASK                         equ 0010h
PIR4_TMR3GIF_POSN                        equ 0005h
PIR4_TMR3GIF_POSITION                    equ 0005h
PIR4_TMR3GIF_SIZE                        equ 0001h
PIR4_TMR3GIF_LENGTH                      equ 0001h
PIR4_TMR3GIF_MASK                        equ 0020h
PIR4_PWM1PIF_POSN                        equ 0006h
PIR4_PWM1PIF_POSITION                    equ 0006h
PIR4_PWM1PIF_SIZE                        equ 0001h
PIR4_PWM1PIF_LENGTH                      equ 0001h
PIR4_PWM1PIF_MASK                        equ 0040h
PIR4_PWM1IF_POSN                         equ 0007h
PIR4_PWM1IF_POSITION                     equ 0007h
PIR4_PWM1IF_SIZE                         equ 0001h
PIR4_PWM1IF_LENGTH                       equ 0001h
PIR4_PWM1IF_MASK                         equ 0080h

