GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
#define AS1E                             BANKMASK(CWG1AS1), 1, b
#define AS2E                             BANKMASK(CWG1AS1), 2, b
#define AS3E                             BANKMASK(CWG1AS1), 3, b
#define AS4E                             BANKMASK(CWG1AS1), 4, b
#define AS5E                             BANKMASK(CWG1AS1), 5, b
#define AS6E                             BANKMASK(CWG1AS1), 6, b
#define AS7E                             BANKMASK(CWG1AS1), 7, b
#define ASYNC                            BANKMASK(T0CON1), 4, b
#define BASE0                            BANKMASK(IVTBASEL), 0, b
#define BASE1                            BANKMASK(IVTBASEL), 1, b
#define BASE10                           BANKMASK(IVTBASEH), 2, b
#define BASE11                           BANKMASK(IVTBASEH), 3, b
#define BASE12                           BANKMASK(IVTBASEH), 4, b
#define BASE13                           BANKMASK(IVTBASEH), 5, b
#define BASE14                           BANKMASK(IVTBASEH), 6, b
#define BASE15                           BANKMASK(IVTBASEH), 7, b
#define BASE16                           BANKMASK(IVTBASEU), 0, b
#define BASE17                           BANKMASK(IVTBASEU), 1, b
#define BASE18                           BANKMASK(IVTBASEU), 2, b
#define BASE19                           BANKMASK(IVTBASEU), 3, b
#define BASE2                            BANKMASK(IVTBASEL), 2, b
#define BASE20                           BANKMASK(IVTBASEU), 4, b
#define BASE3                            BANKMASK(IVTBASEL), 3, b
#define BASE4                            BANKMASK(IVTBASEL), 4, b
#define BASE5                            BANKMASK(IVTBASEL), 5, b
#define BASE6                            BANKMASK(IVTBASEL), 6, b
#define BASE7                            BANKMASK(IVTBASEL), 7, b
#define BASE8                            BANKMASK(IVTBASEH), 0, b
#define BASE9                            BANKMASK(IVTBASEH), 1, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCLIE                            BANKMASK(I2C1ERR), 1, b
#define BCLIF                            BANKMASK(I2C1ERR), 5, b
#define BFRE                             BANKMASK(I2C1STAT0), 7, b
#define BFRET0                           BANKMASK(I2C1CON2), 0, b
#define BFRET1                           BANKMASK(I2C1CON2), 1, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTOC0                            BANKMASK(I2C1BTOC), 0, b
#define BTOC1                            BANKMASK(I2C1BTOC), 1, b
#define BTOC2                            BANKMASK(I2C1BTOC), 2, b
#define BTOC3                            BANKMASK(I2C1BTOC), 3, b
#define BTOIE                            BANKMASK(I2C1ERR), 2, b
#define BTOIF                            BANKMASK(I2C1ERR), 6, b
#define BUF0                             BANKMASK(DMAnBUF), 0, b
#define BUF1                             BANKMASK(DMAnBUF), 1, b
#define BUF2                             BANKMASK(DMAnBUF), 2, b
#define BUF3                             BANKMASK(DMAnBUF), 3, b
#define BUF4                             BANKMASK(DMAnBUF), 4, b
#define BUF5                             BANKMASK(DMAnBUF), 5, b
#define BUF6                             BANKMASK(DMAnBUF), 6, b
#define BUF7                             BANKMASK(DMAnBUF), 7, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C0EN                             BANKMASK(U1CON2), 3, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE1), 4, a
#define C1IF                             BANKMASK(PIR1), 4, a
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR1), 4, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE5), 4, a
#define C2IF                             BANKMASK(PIR5), 4, a
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR5), 4, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, b
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, b
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, b
#define CCP1EN                           BANKMASK(CCP1CON), 7, b
#define CCP1FMT                          BANKMASK(CCP1CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 6, a
#define CCP1IF                           BANKMASK(PIR3), 6, a
#define CCP1IP                           BANKMASK(IPR3), 6, b
#define CCP1MD                           BANKMASK(PMD2), 7, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, b
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, b
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, b
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, b
#define CCP1OUT                          BANKMASK(CCP1CON), 5, b
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5, b
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CH0                              BANKMASK(MD1CARH), 0, b
#define CH1                              BANKMASK(MD1CARH), 1, b
#define CH2                              BANKMASK(MD1CARH), 2, b
#define CH3                              BANKMASK(MD1CARH), 3, b
#define CHPOL                            BANKMASK(MD1CON1), 5, b
#define CHSYNC                           BANKMASK(MD1CON1), 4, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CKS4                             BANKMASK(NCO1CLK), 4, b
#define CL0                              BANKMASK(MD1CARL), 0, b
#define CL1                              BANKMASK(MD1CARL), 1, b
#define CL2                              BANKMASK(MD1CARL), 2, b
#define CL3                              BANKMASK(MD1CARL), 3, b
#define CLC1IE                           BANKMASK(PIE0), 5, a
#define CLC1IF                           BANKMASK(PIR0), 5, a
#define CLC1IP                           BANKMASK(IPR0), 5, b
#define CLC1MD                           BANKMASK(PMD4), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE5), 5, a
#define CLC2IF                           BANKMASK(PIR5), 5, a
#define CLC2IP                           BANKMASK(IPR5), 5, b
#define CLC2MD                           BANKMASK(PMD4), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE7), 5, a
#define CLC3IF                           BANKMASK(PIR7), 5, a
#define CLC3IP                           BANKMASK(IPR7), 5, b
#define CLC3MD                           BANKMASK(PMD4), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE8), 5, a
#define CLC4IF                           BANKMASK(PIR8), 5, a
#define CLC4IP                           BANKMASK(IPR8), 5, b
#define CLC4MD                           BANKMASK(PMD4), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN0PPS5                       BANKMASK(CLCIN0PPS), 5, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN1PPS5                       BANKMASK(CLCIN1PPS), 5, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN2PPS5                       BANKMASK(CLCIN2PPS), 5, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLCIN3PPS5                       BANKMASK(CLCIN3PPS), 5, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLPOL                            BANKMASK(MD1CON1), 1, b
#define CLSYNC                           BANKMASK(MD1CON1), 0, b
#define CM1IE                            BANKMASK(PIE1), 4, a
#define CM1IF                            BANKMASK(PIR1), 4, a
#define CM1IP                            BANKMASK(IPR1), 4, b
#define CM1MD                            BANKMASK(PMD1), 7, b
#define CM2IE                            BANKMASK(PIE5), 4, a
#define CM2IF                            BANKMASK(PIR5), 4, a
#define CM2IP                            BANKMASK(IPR5), 4, b
#define CM2MD                            BANKMASK(PMD2), 0, b
#define CNT10                            BANKMASK(I2C1CNTH), 2, b
#define CNT11                            BANKMASK(I2C1CNTH), 3, b
#define CNT12                            BANKMASK(I2C1CNTH), 4, b
#define CNT13                            BANKMASK(I2C1CNTH), 5, b
#define CNT14                            BANKMASK(I2C1CNTH), 6, b
#define CNT15                            BANKMASK(I2C1CNTH), 7, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT8                             BANKMASK(I2C1CNTH), 0, b
#define CNT9                             BANKMASK(I2C1CNTH), 1, b
#define CNTIE                            BANKMASK(I2C1PIE), 7, b
#define CNTIF                            BANKMASK(I2C1PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CPOL                             BANKMASK(SMT1CON0), 2, b
#define CPRDY                            BANKMASK(ADCPCON), 0, b
#define CPRUP                            BANKMASK(SMT1STAT), 7, b
#define CPWUP                            BANKMASK(SMT1STAT), 6, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, a
#define CRCIF                            BANKMASK(PIR0), 6, a
#define CRCIP                            BANKMASK(IPR0), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSD                              BANKMASK(I2C1CON1), 0, b
#define CSEL0                            BANKMASK(SMT1CLK), 0, b
#define CSEL1                            BANKMASK(SMT1CLK), 1, b
#define CSEL2                            BANKMASK(SMT1CLK), 2, b
#define CSEL3                            BANKMASK(SMT1CLK), 3, b
#define CSTR                             BANKMASK(I2C1CON0), 4, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, a
#define CSWIF                            BANKMASK(PIR0), 3, a
#define CSWIP                            BANKMASK(IPR0), 3, b
#define CTS0                             BANKMASK(CCP1CAP), 0, b
#define CTS1                             BANKMASK(CCP1CAP), 1, b
#define CTS2                             BANKMASK(CCP1CAP), 2, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE6), 2, a
#define CWG1IF                           BANKMASK(PIR6), 2, a
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1INPPS5                       BANKMASK(CWG1PPS), 5, b
#define CWG1IP                           BANKMASK(IPR6), 2, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1LSDB0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSDB1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD2), 6, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define CWGINPPS5                        BANKMASK(CWG1PPS), 5, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D1S6                             BANKMASK(CLCnSEL0), 6, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D2S6                             BANKMASK(CLCnSEL1), 6, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D3S6                             BANKMASK(CLCnSEL2), 6, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define D4S6                             BANKMASK(CLCnSEL3), 6, b
#define DAC1EN                           BANKMASK(DAC1CON), 7, b
#define DAC1MD                           BANKMASK(PMD2), 2, b
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
#define DAC1R1                           BANKMASK(DAC1DATL), 1, b
#define DAC1R2                           BANKMASK(DAC1DATL), 2, b
#define DAC1R3                           BANKMASK(DAC1DATL), 3, b
#define DAC1R4                           BANKMASK(DAC1DATL), 4, b
#define DAC1R5                           BANKMASK(DAC1DATL), 5, b
#define DAC1R6                           BANKMASK(DAC1DATL), 6, b
#define DAC1R7                           BANKMASK(DAC1DATL), 7, b
#define DAC2EN                           BANKMASK(DAC2CON), 7, b
#define DAC2MD                           BANKMASK(PMD5), 1, b
#define DAC2PSS0                         BANKMASK(DAC2CON), 2, b
#define DAC2PSS1                         BANKMASK(DAC2CON), 3, b
#define DAC2R0                           BANKMASK(DAC2DATL), 0, b
#define DAC2R1                           BANKMASK(DAC2DATL), 1, b
#define DAC2R2                           BANKMASK(DAC2DATL), 2, b
#define DAC2R3                           BANKMASK(DAC2DATL), 3, b
#define DAC2R4                           BANKMASK(DAC2DATL), 4, b
#define DAC2R5                           BANKMASK(DAC2DATL), 5, b
#define DAC2R6                           BANKMASK(DAC2DATL), 6, b
#define DAC2R7                           BANKMASK(DAC2DATL), 7, b
#define DATA                             BANKMASK(I2C1STAT0), 3, b
#define DATA0                            BANKMASK(CRCDATAL), 0, b
#define DATA1                            BANKMASK(CRCDATAL), 1, b
#define DATA10                           BANKMASK(CRCDATAH), 2, b
#define DATA11                           BANKMASK(CRCDATAH), 3, b
#define DATA12                           BANKMASK(CRCDATAH), 4, b
#define DATA13                           BANKMASK(CRCDATAH), 5, b
#define DATA14                           BANKMASK(CRCDATAH), 6, b
#define DATA15                           BANKMASK(CRCDATAH), 7, b
#define DATA16                           BANKMASK(CRCDATAU), 0, b
#define DATA17                           BANKMASK(CRCDATAU), 1, b
#define DATA18                           BANKMASK(CRCDATAU), 2, b
#define DATA19                           BANKMASK(CRCDATAU), 3, b
#define DATA2                            BANKMASK(CRCDATAL), 2, b
#define DATA20                           BANKMASK(CRCDATAU), 4, b
#define DATA21                           BANKMASK(CRCDATAU), 5, b
#define DATA22                           BANKMASK(CRCDATAU), 6, b
#define DATA23                           BANKMASK(CRCDATAU), 7, b
#define DATA24                           BANKMASK(CRCDATAT), 0, b
#define DATA25                           BANKMASK(CRCDATAT), 1, b
