GopalSaraf/Practicals/PSDL/include/proc/pic18f16q41.inc
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RD161                            BANKMASK(T1CON), 1, b
#define RD163                            BANKMASK(T3CON), 1, b
#define READ                             BANKMASK(I2C1STAT0), 4, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define REPEAT                           BANKMASK(SMT1CON1), 6, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RESON                            BANKMASK(OPA1CON1), 3, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSCIE                            BANKMASK(I2C1PIE), 1, b
#define RSCIF                            BANKMASK(I2C1PIR), 1, b
#define RSEN                             BANKMASK(I2C1CON0), 6, b
#define RST                              BANKMASK(SMT1STAT), 5, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RXO                              BANKMASK(I2C1CON1), 2, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCIE                             BANKMASK(I2C1PIE), 0, b
#define SCIF                             BANKMASK(I2C1PIR), 0, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SDAHT0                           BANKMASK(I2C1CON2), 2, b
#define SDAHT1                           BANKMASK(I2C1CON2), 3, b
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SETUP0                           BANKMASK(CRCCON0), 2, b
#define SETUP1                           BANKMASK(CRCCON0), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHIFT0                           BANKMASK(CRCSHFTL), 0, b
#define SHIFT1                           BANKMASK(CRCSHFTL), 1, b
#define SHIFT10                          BANKMASK(CRCSHFTH), 2, b
#define SHIFT11                          BANKMASK(CRCSHFTH), 3, b
#define SHIFT12                          BANKMASK(CRCSHFTH), 4, b
#define SHIFT13                          BANKMASK(CRCSHFTH), 5, b
#define SHIFT14                          BANKMASK(CRCSHFTH), 6, b
#define SHIFT15                          BANKMASK(CRCSHFTH), 7, b
#define SHIFT16                          BANKMASK(CRCSHFTU), 0, b
#define SHIFT17                          BANKMASK(CRCSHFTU), 1, b
#define SHIFT18                          BANKMASK(CRCSHFTU), 2, b
#define SHIFT19                          BANKMASK(CRCSHFTU), 3, b
#define SHIFT2                           BANKMASK(CRCSHFTL), 2, b
#define SHIFT20                          BANKMASK(CRCSHFTU), 4, b
#define SHIFT21                          BANKMASK(CRCSHFTU), 5, b
#define SHIFT22                          BANKMASK(CRCSHFTU), 6, b
#define SHIFT23                          BANKMASK(CRCSHFTU), 7, b
#define SHIFT24                          BANKMASK(CRCSHFTT), 0, b
#define SHIFT25                          BANKMASK(CRCSHFTT), 1, b
#define SHIFT26                          BANKMASK(CRCSHFTT), 2, b
#define SHIFT27                          BANKMASK(CRCSHFTT), 3, b
#define SHIFT28                          BANKMASK(CRCSHFTT), 4, b
#define SHIFT29                          BANKMASK(CRCSHFTT), 5, b
#define SHIFT3                           BANKMASK(CRCSHFTL), 3, b
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SMA                              BANKMASK(I2C1STAT0), 6, b
#define SMT1AS                           BANKMASK(SMT1STAT), 0, b
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0, b
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1, b
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2, b
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3, b
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4, b
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5, b
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6, b
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7, b
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0, b
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1, b
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2, b
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3, b
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2, b
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4, b
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5, b
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6, b
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7, b
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3, b
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4, b
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5, b
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6, b
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1CSEL3                        BANKMASK(SMT1CLK), 3, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE1), 5, a
#define SMT1IF                           BANKMASK(PIR1), 5, a
#define SMT1IP                           BANKMASK(IPR1), 5, b
#define SMT1MD                           BANKMASK(PMD1), 5, b
#define SMT1MODE0                        BANKMASK(SMT1CON1), 0, b
#define SMT1MODE1                        BANKMASK(SMT1CON1), 1, b
#define SMT1MODE2                        BANKMASK(SMT1CON1), 2, b
#define SMT1MODE3                        BANKMASK(SMT1CON1), 3, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE1), 6, a
#define SMT1PRAIF                        BANKMASK(PIR1), 6, a
#define SMT1PRAIP                        BANKMASK(IPR1), 6, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE1), 7, a
#define SMT1PWAIF                        BANKMASK(PIR1), 7, a
#define SMT1PWAIP                        BANKMASK(IPR1), 7, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0, b
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1, b
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2, b
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3, b
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4, b
#define SMT1SIGPPS5                      BANKMASK(SMT1SIGPPS), 5, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0, b
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1, b
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2, b
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3, b
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4, b
#define SMT1WINPPS5                      BANKMASK(SMT1WINPPS), 5, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SOC0                             BANKMASK(OPA1CON0), 0, b
#define SOC1                             BANKMASK(OPA1CON0), 1, b
#define SOC2                             BANKMASK(OPA1CON0), 2, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SP6                              BANKMASK(STKPTR), 6, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
